duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/lcd/lcd.c
	//read head data
	memcpy((uint8_t*)&uni_infor.head, ptr_font, FONT_UNI_HEAD_LEN);
	if((uni_infor.head.id[0] != FONT_UNI_HEAD_FLAG_0)
		||(uni_infor.head.id[1] != FONT_UNI_HEAD_FLAG_1)
		||(uni_infor.head.id[2] != FONT_UNI_HEAD_FLAG_2))
	{
		return;
	}
	
	//read sect data
	memcpy((uint8_t*)&uni_infor.sect, ptr_font[FONT_UNI_HEAD_LEN], uni_infor.head.sect_num*FONT_UNI_SECT_LEN);
	
	//read index data
	for(i=0;i<uni_infor.head.sect_num;i++)
	{
		if((word>=uni_infor.sect[i].first_char)&&((word<=uni_infor.sect[i].last_char)))
		{
			index_addr = (word-uni_infor.sect[i].first_char)*4+uni_infor.sect[i].index_addr;
			break;
		}
	}
	
	width = ptr_font[index_addr+3]>>2;
#endif

	return width;
}

//根据字体测量字符串的长度和高度
//p:字符串指针
//width,height:返回的字符串宽度和高度变量地址
void LCD_MeasureUniString(uint16_t *p, uint16_t *width, uint16_t *height)
{
	uint8_t font_size;
	uint16_t *pre,*next,show;
	uint16_t space=0x0020;
	font_arabic_forms arab_al_froms = {0x00};

	*width = 0;
	*height = 0;

	if(p == NULL)
		return;

	(*height) = system_font;

	pre = NULL;
	next = p+1;
	while(*p)
	{
		uint8_t flag = 0;//0x00000000:isolated; 0b00000001:initial; 0b00000011:medial; 0b00000010:final
		
		show = *p;

	#ifndef FW_FOR_CN
		if((*next != 0x0000)&&(*next != space))
		{
			if(LCD_FindArabAlphabetFromSpecial(*p, *next, &show))
			{
				p = next;
				goto do_measure;
			}
		}
	
		if((pre != NULL)&&(*pre != space))
			flag |= 0b00000010;
		if((*next != 0x0000)&&(*next != space))
			flag |= 0b00000001;

		if(flag != 0)
		{
			LCD_FindArabAlphabetFrom(*p, &arab_al_froms);
			switch(flag)
			{
			case 1:
				show = arab_al_froms.initial;
				break;
			case 2:
				show = arab_al_froms.final;
				break;
			case 3:
				show = arab_al_froms.medial;
				break;
			}
		}
	#endif

	do_measure:
		(*width) += LCD_Measure_Uni_Byte(show);

		pre = p;
		p++;
		next = p+1;
	}  
}

void LCD_ShowUniStringInRect(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t *p)
{
	int16_t str_x=x,str_y=y,str_w,str_h;
	uint8_t w=0;
	uint16_t end=0x000a;
	font_arabic_forms arab_al_froms = {0x00};

	str_w = x+width;
	if(str_w >= LCD_WIDTH)
		str_w = LCD_WIDTH;

	str_h = y+height;
	while(*p)
	{       
		if(*p==end){str_x=x;str_y+=system_font;p++;}
		if(str_y>=str_h)break;//退出
		if(*p==0x0000)break;//退出
		w = LCD_Measure_Uni_Byte(*p);
		if((str_x+w)>=str_w){str_x=x;str_y+=system_font;}
		if(str_y>=str_h)break;//退出
		LCD_Show_Uni_Char_from_flash(str_x,str_y,*p,0);
		str_x += w;
		
		p++;
	}
}

void LCD_ShowUniStringRtoLInRect(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t *p)
{
	int16_t str_x=x,str_y=y,str_w,str_h;
	uint16_t *pre,*next,show;
	uint8_t w=0;
	uint16_t end=0x000a,space=0x0020;
	font_arabic_forms arab_al_froms = {0x00};

	if(g_language_r2l)
	{
		str_w = 0;
		if(x > width)
			str_w = x-width;
	}

	str_h = y+height;

	pre = NULL;
	next = p+1;
	while(*p)
	{   
		uint8_t flag = 0;//0b00000000:isolated; 0b00000001:initial; 0b00000011:medial; 0b00000010:final
		
		if(*p==end){str_x=x;str_y+=system_font;p++;}
		if(str_y>=str_h)break;//退出
		if(*p==0x0000)break;//退出

		show = *p;

		if((*next != 0x0000)&&(*next != space))
		{
			if(LCD_FindArabAlphabetFromSpecial(*p, *next, &show))
			{
				p = next;
				goto do_show;
			}
		}
		
		if((pre != NULL)&&(*pre != space))
			flag |= 0b00000010;
		if((*next != 0x0000)&&(*next != space))
			flag |= 0b00000001;
		if(flag != 0)
		{
			LCD_FindArabAlphabetFrom(*p, &arab_al_froms);
			switch(flag)
			{
			case 1:
				show = arab_al_froms.initial;
				break;
			case 2:
				show = arab_al_froms.final;
				break;
			case 3:
				show = arab_al_froms.medial;
				break;
			}
		}
	
	do_show:
		w = LCD_Measure_Uni_Byte(show);
		if((str_x-w)<=str_w){str_x=x-w;str_y+=system_font;}
		if(str_y>=str_h)break;//退出
		str_x -= w;
		LCD_Show_Uni_Char_from_flash(str_x,str_y,show,0);
		
		pre = p;
		p++;
		next = p+1;
	}
}

//显示中英文字符串
//x,y:起点坐标
//*p:字符串起始地址	
void LCD_ShowUniString(uint16_t x, uint16_t y, uint16_t *p)
{
	int16_t str_x=x,str_y=y;
	uint8_t width;

	if((str_x >= LCD_WIDTH)||(str_y >= LCD_HEIGHT))
		return;

	while(*p)
	{
		if(str_x>=LCD_WIDTH)break;//退出
		width = LCD_Show_Uni_Char_from_flash(str_x,str_y,*p,0);
		str_x += width;

		p++;
	}
}

//显示中英文字符串
//x,y:起点坐标
//*p:字符串起始地址	
void LCD_ShowUniStringRtoL(uint16_t x, uint16_t y, uint16_t *p)
{
	int16_t str_x=x,str_y=y;
	uint16_t *pre,*next,show;
	uint16_t space=0x0020;
	uint8_t width=0;
	font_arabic_forms arab_al_froms = {0x00};

	if((str_x >= LCD_WIDTH)||(str_y >= LCD_HEIGHT))
		return;

	pre = NULL;
	next = p+1;
	while(*p)
	{
		uint8_t flag = 0;//0x00000000:isolated; 0b00000001:initial; 0b00000011:medial; 0b00000010:final
		
		if(str_x<=0)break;//退出

		show = *p;

		if((*next != 0x0000)&&(*next != space))
		{
			if(LCD_FindArabAlphabetFromSpecial(*p, *next, &show))
			{
				p = next;
				goto do_show;
			}
		}
		
		if((pre != NULL)&&(*pre != space))
			flag |= 0b00000010;
		if((*next != 0x0000)&&(*next != space))
			flag |= 0b00000001;
		if(flag != 0)
		{
			LCD_FindArabAlphabetFrom(*p, &arab_al_froms);
			switch(flag)
			{
			case 1:
				show = arab_al_froms.initial;
				break;
			case 2:
				show = arab_al_froms.final;
				break;
			case 3:
				show = arab_al_froms.medial;
				break;
			}
		}

	do_show:
		width = LCD_Measure_Uni_Byte(show);
		if(str_x<=width)break;//退出
		str_x -= width;
		LCD_Show_Uni_Char_from_flash(str_x,str_y,show,0);

		pre = p;
		p++;
		next = p+1;
	}
}

#elif defined(FONTMAKER_MBCS_FONT)
//根据字体测量字符的宽度
//byte:字符
uint8_t LCD_Measure_Mbcs_Byte(uint8_t byte)
{
	uint8_t width,*ptr_font;
	uint8_t fontbuf[4] = {0};	
	uint32_t index_addr,font_addr=0;

#ifdef IMG_FONT_FROM_FLASH
	switch(system_font)
	{
	#ifdef FONT_16
		case FONT_SIZE_16:
			font_addr = FONT_RM_ASC_16_ADDR;
			break;
	#endif
	#ifdef FONT_24
		case FONT_SIZE_24:
			font_addr = FONT_RM_ASC_24_ADDR;
			break;
	#endif
	#ifdef FONT_32
		case FONT_SIZE_32:
			font_addr = FONT_RM_ASC_32_ADDR;
			break;
	#endif
		default:
			return;
	}

	index_addr = FONT_MBCS_HEAD_LEN+4*byte;
	SpiFlash_Read(fontbuf, font_addr+index_addr, 4);
	width = fontbuf[3]>>2;
#else
	switch(system_font)
	{
	#ifdef FONT_16
		case FONT_SIZE_16:
			ptr_font=asc2_16_rm; 	 	//调用1608字体
			break;
	#endif
	#ifdef FONT_24
		case FONT_SIZE_24:
			ptr_font=asc2_24_rm;			//调用2412字体
			break;
	#endif
	#ifdef FONT_32
		case FONT_SIZE_32:
			ptr_font=asc2_32_rm;			//调用3216字体
			break;
	#endif
		default:
			return 0;							//没有的字库
	}
	
	index_addr = FONT_MBCS_HEAD_LEN+4*byte;
	width = ptr_font[index_addr+3]>>2;
#endif

