duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/lcd/lcd.c
	return width;
}
#endif

//指定位置显示图片
//color:图片数据指针
//x:图片显示X坐标
//y:图片显示Y坐标
void LCD_ShowImg(uint16_t x, uint16_t y, unsigned char *color)
{
#if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
	LCD_dis_img(x, y, color);
#else
	LCD_dis_pic(x, y, color);
#endif/*LCD_VGM068A4W01_SH1106G||LCD_VGM096064A6W01_SP5090*/
}

#if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
//在指定矩形区域内显示中英文字符串
//x,y:起点坐标
//width,height:区域大小 (height<PAGE_MAX) 
//*p:字符串起始地址	
void LCD_ShowStrInRect(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint8_t *p)
{
	uint16_t str_x=x,str_y=y,str_w,str_h;
	uint16_t phz=0;
	uint8_t y_offset = (system_font/8);
	
	str_w = width+x;
	str_h = height+y;

	while(*p)
	{       
		if(str_x>=str_w){str_x=x;str_y+=y_offset;}
		if(*p=='\n'){str_x=x;str_y+=y_offset;p++;}
		if(str_y>=str_h)break;//退出
		if(*p==0x00)break;//退出
		if(*p<0x80)
		{
		#ifdef IMG_FONT_FROM_FLASH
			LCD_ShowEn_from_flash(str_x,str_y,*p);
		#else
			LCD_ShowEn(str_x,str_y,*p);
		#endif
			str_x+=system_font/2;
			p++;
		}
		else if(*(p+1))
		{
			phz = *p<<8;
			phz += *(p+1);
		#ifdef IMG_FONT_FROM_FLASH
			LCD_ShowCn_from_flash(str_x,str_y,phz);
		#else
			LCD_ShowCn(str_x,str_y,phz);
		#endif
			str_x+=system_font;
			p+=2;
		}        
	}
}

#endif/*LCD_VGM068A4W01_SH1106G||LCD_VGM096064A6W01_SP5090*/

//在指定矩形区域内显示中英文字符串
//x,y:起点坐标
//width,height:区域大小  
//*p:字符串起始地址	
void LCD_ShowStringInRect(uint16_t x,uint16_t y,uint16_t width,uint16_t height,uint8_t *p)
{
	uint16_t str_x=x,str_y=y,str_w,str_h;
	uint16_t w,phz=0;

	str_w = width+x;
	str_h = height+y;
	while(*p)
	{       
		if(str_x>=width){str_x=x;str_y+=system_font;}
		if(*p=='\n'){str_x=x;str_y+=system_font;p++;}
		if(str_y>=height)break;//退出
		if(*p==0x00)break;//退出
		if(*p<0x80)
		{
		#ifdef IMG_FONT_FROM_FLASH
		  #ifdef FONTMAKER_UNICODE_FONT
			w = LCD_Show_Uni_Char_from_flash(str_x,str_y,*p,0);
		  	str_x += w;
		  #elif defined(FONTMAKER_MBCS_FONT)

		  #else	
			LCD_ShowChar_from_flash(str_x,str_y,*p,0);
		  #endif
		#else
			LCD_ShowChar(str_x,str_y,*p,0);
		#endif
			str_x+=system_font/2;
			p++;
		}
		else if(*(p+1))
		{
			phz = *p<<8;
			phz += *(p+1);
		#ifdef IMG_FONT_FROM_FLASH
		  #ifdef FONTMAKER_UNICODE_FONT

		  #elif defined(FONTMAKER_MBCS_FONT)

		  #else
			LCD_ShowChineseChar_from_flash(str_x,str_y,phz,0);
		  #endif
		#else
			LCD_ShowChineseChar(str_x,str_y,phz,0);
		#endif
			str_x+=system_font;
			p+=2;
		}        
	}
}

//显示中英文字符串
//x,y:起点坐标
//*p:字符串起始地址	
void LCD_ShowString(uint16_t x,uint16_t y,uint8_t *p)
{
	uint16_t str_x=x,str_y=y,str_w,str_h;
	uint8_t x0=x;
	uint16_t width,phz=0;

	while(*p)
	{       
		if(str_x>=LCD_WIDTH)break;//退出
		if(str_y>=LCD_HEIGHT)break;//退出
		if(*p<0x80)
		{
		#ifdef IMG_FONT_FROM_FLASH
		  #ifdef FONTMAKER_UNICODE_FONT
		  	width = LCD_Show_Uni_Char_from_flash(str_x,str_y,*p,0);
		  	str_x += width;
		  #elif defined(FONTMAKER_MBCS_FONT)
			width = LCD_Show_Mbcs_Char_from_flash(str_x,str_y,*p,0);
		  	str_x += width;
		  #else
		   #if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
			LCD_ShowEn_from_flash(str_x,str_y,*p);
		   #else
			LCD_ShowChar_from_flash(str_x,str_y,*p,0);
		   #endif
		  	str_x += system_font/2;
		  #endif
		#else
		  #ifdef FONTMAKER_MBCS_FONT
			width = LCD_Show_Mbcs_Char(str_x,str_y,*p,0);
		  	str_x += width;
		  #else
		   #if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
			LCD_ShowEn(str_x,str_y,*p);
		   #else
			LCD_ShowChar(str_x,str_y,*p,0);
		   #endif
		  	str_x += system_font/2;
		  #endif
		#endif
			
			p++;
		}
		else if(*(p+1))
		{
			phz = *p<<8;
			phz += *(p+1);
		#ifdef IMG_FONT_FROM_FLASH
		  #ifdef FONTMAKER_UNICODE_FONT
		  
		  #elif defined(FONTMAKER_MBCS_FONT)
			LCD_Show_Mbcs_CJK_Char_from_flash(str_x,str_y,phz,0);
		  #else
		   #if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
			LCD_ShowCn_from_flash(str_x,str_y,phz);
		   #else
			LCD_ShowChineseChar_from_flash(str_x,str_y,phz,0);
		   #endif
		  #endif
		#else
		  #if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
			LCD_ShowCn(str_x,str_y,phz);
		  #else
			LCD_ShowChineseChar(str_x,str_y,phz,0);
		  #endif
		#endif
			str_x+=system_font;
			p+=2;
		}        
	}
}

//根据字体测量字符串的长度和高度
//p:字符串指针
//width,height:返回的字符串宽度和高度变量地址
void LCD_MeasureString(uint8_t *p, uint16_t *width,uint16_t *height)
{
	uint8_t font_size;

	*width = 0;
	*height = 0;

	if(p == NULL || strlen((const char *)p) == 0)
		return;

	(*height) = system_font;

	while(*p)
	{
		if(*p<0x80)
		{
		#ifdef FONTMAKER_UNICODE_FONT
			(*width) += LCD_Measure_Uni_Byte(*p);
		#elif defined(FONTMAKER_MBCS_FONT)
			(*width) += LCD_Measure_Mbcs_Byte(*p);
		#else
			(*width) += system_font/2;
		#endif
			p++;
		}
		else if(*(p+1))
		{
			(*width) += system_font;
			p += 2;
		}        
	}  
}

//恢复字体画笔默认颜色
void LCD_ReSetFontColor(void)
{
	POINT_COLOR = WHITE;
}

//设置字体画笔颜色
void LCD_SetFontColor(uint16_t color)
{
	POINT_COLOR = color;
}

//恢复字体背景默认颜色
void LCD_ReSetFontBgColor(void)
{
	BACK_COLOR = BLACK;
}

//设置字体背景颜色
void LCD_SetFontBgColor(uint16_t color)
{
	BACK_COLOR = color;
}

//设置系统字体
//font_size:枚举字体大小
void LCD_SetFontSize(uint8_t font_size)
{
	if(font_size > FONT_SIZE_MIN && font_size < FONT_SIZE_MAX)
		system_font = font_size;
}

void LCDMsgProcess(void)
{
	if(lcd_sleep_in)
	{
		if(LCD_Get_BL_Mode() != LCD_BL_ALWAYS_ON)
		{
			LCD_BL_Off();

			if((screen_id == SCREEN_ID_STEPS)
				||(screen_id == SCREEN_ID_SLEEP)
				)
			{
				EnterIdleScreen();
			}
			
			LCD_SleepIn();
		}
		
		lcd_sleep_in = false;
	}

	if(lcd_sleep_out)
	{
		LCD_SleepOut();
		
		if(IsInIdleScreen())
		{
			scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TIME|SCREEN_EVENT_UPDATE_DATE|SCREEN_EVENT_UPDATE_WEEK|SCREEN_EVENT_UPDATE_SIG|SCREEN_EVENT_UPDATE_NET_MODE|SCREEN_EVENT_UPDATE_BAT;
			IdleScreenProcess();
		}

		LCD_BL_On();

		lcd_sleep_out = false;
	}
}
